publish/2018/emacs-google-calendar-org-gcal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2020-09-12 Sat 07:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>emacs の org-mode と google calendar を連携させる org-gcal</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="clothoid" />
<meta name="keywords" content="emacs google calendar ics org" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://clothoid.github.io/sitemap.html"> UP </a>
 |
 <a accesskey="H" href="https://clothoid.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">emacs の org-mode と google calendar を連携させる org-gcal</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaf5c041">1. 目的</a></li>
<li><a href="#org0288005">2. 設定</a></li>
<li><a href="#org6a248c8">3. 使い方</a></li>
<li><a href="#org35b9035">4. やりたいけど、分からないこと</a></li>
<li><a href="#orgf0d3d21">5. 参考</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgaf5c041" class="outline-2">
<h2 id="orgaf5c041"><span class="section-number-2">1</span> 目的</h2>
<div class="outline-text-2" id="text-1">
<p>
google calendar の内容を org ファイルと同期連携させる
</p>
</div>
</div>

<div id="outline-container-org0288005" class="outline-2">
<h2 id="org0288005"><span class="section-number-2">2</span> 設定</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>gogole calendar API の有効化
<ol class="org-ol">
<li><a href="https://console.developers.google.com/cloud-resource-manager">Google Developers Console</a> へアクセス</li>
<li>[プロジェクトを作成] を選択</li>
<li>[プロジェクト名] に [org-gcal] を入力</li>
<li>[作成] を選択</li>
<li>プロジェクトの選択より、[org-gcal] を選択</li>
<li>バーガーメニューより、[API とサービス] &gt; [ライブラリ] を選択</li>
<li>[google calendar] で検索</li>
<li>[Google Calendar API] を選択 <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></li>
<li>[有効にする] を選択</li>
<li>[認証情報を作成] を選択</li>
<li>[API を呼び出す場所] で [その他の UI (Windows、CL ツールなど)] を選択</li>
<li>[アクセスするデータの種類] で [ユーザーデータ] を選択</li>
<li>[必要な認証情報] を選択</li>
<li>[OAuth 2.0 クライアント ID を作成する] にて、[org-gcal] を入力</li>
<li>[OAuth クライアント ID を作成] ボタンを選択</li>
<li>[OAuth 2.0 同意画面を設定する] で以下を設定
<ul class="org-ul">
<li>メールアドレス : (メールアドレスを選択)</li>
<li>ユーザーに表示するサービス名 : (適当に org-gcal など)</li>
</ul></li>
<li>[次へ] を選択</li>
<li>[認証情報をダウンロードする] で [ダウンロード] を選択</li>
<li><p>
ダウンロードされた [client_id.json] を開き、 client_id、client_secret の値を確認
</p>
<div class="org-src-container">
<pre class="src src-json">{
  <span style="color: #0000FF;">"installed"</span>: {
    <span style="color: #0000FF;">"client_id"</span>: <span style="color: #008000;">"ThisIsClientID"</span>,
    <span style="color: #0000FF;">"project_id"</span>: <span style="color: #008000;">"ThisIsProjectID"</span>,
    <span style="color: #0000FF;">"auth_uri"</span>: <span style="color: #008000;">"ThisIsAuthURL"</span>,
    <span style="color: #0000FF;">"token_uri"</span>: <span style="color: #008000;">"ThisIsTokenURL"</span>,
    <span style="color: #0000FF;">"auth_provider_x509_cert_url"</span>: <span style="color: #008000;">"ThisIsCertURL"</span>,
    <span style="color: #0000FF;">"client_secret"</span>: <span style="color: #008000;">"ThisIsClientSecret"</span>,
    <span style="color: #0000FF;">"redirect_uris"</span>: [
      <span style="color: #008000;">"ThisIsURN"</span>,
      <span style="color: #008000;">"ThisIsHTTP"</span>
    ]
  }
}
</pre>
</div></li>
</ol></li>
<li>[カレンダー ID] の取得
<ol class="org-ol">
<li><a href="https://calendar.google.com">Google Calendar</a> にアクセス</li>
<li>[歯車マーク] &gt; [設定 を選択]</li>
<li>[マイカレンダーの設定] の中から同期したいカレンダーを選択</li>
<li>[カレンダー ID] の値をメモ (e.g. sample@foo.google.com)</li>
</ol></li>
<li>org-gcal.el のインストール (M-x package-install org-gcal)</li>
<li><p>
init.el を設定
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #0000FF;">require</span> '<span style="color: #D0372D;">org-gcal</span>)
(<span style="color: #0000FF;">setq</span>
 org-gcal-client-id
 <span style="color: #008000;">"ThisIsClientID"</span>
 org-gcal-client-secret <span style="color: #008000;">"ThisIsClientSecret"</span>
 <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">ID &#12364; sample@foo.google.com &#12398;&#12459;&#12524;&#12531;&#12480;&#12540;&#12434; ~/calendar.org &#12434;&#21516;&#26399;</span>
 org-gcal-file-alist '(
                       (<span style="color: #008000;">"sample@foo.google.com"</span> .  <span style="color: #008000;">"~/calendar.org"</span>)
                       <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">("sample2@foo.google.com" .  "~/calendar2.org")</span>
                       ))
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">token &#12398;&#20445;&#23384;&#22580;&#25152;&#12434;&#22793;&#26356;</span>
(<span style="color: #0000FF;">setq</span> org-gcal-dir <span style="color: #008000;">"~/Dropbox/.emacs.d/local-lisp/org-gcal"</span>)
</pre>
</div></li>
<li>M-x org-gcal-fetch を実行</li>
<li>ブラウザが開いて、token が表示されるので、コピーしてミニバッファに入力</li>
</ol>
</div>
</div>

<div id="outline-container-org6a248c8" class="outline-2">
<h2 id="org6a248c8"><span class="section-number-2">3</span> 使い方</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>M-x org-gcal-sync で同期</li>
<li>M-x org-gcal-post-at-point でカーソル位置の内容をカレンダーに登録</li>
<li>M-x org-gcal-delete-at-point で削除</li>
</ul>
</div>
</div>

<div id="outline-container-org35b9035" class="outline-2">
<h2 id="org35b9035"><span class="section-number-2">4</span> やりたいけど、分からないこと</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Time Zone の設定</li>
<li>Proxy 下での利用方法</li>
<li>M-x org-gcal-fetch/sync の定期実行方法</li>
<li>M-x org-set-tags-command との連携方法</li>
<li>M-x org-schedule との連携方法</li>
<li>階層のつけ方</li>
</ul>
</div>
</div>

<div id="outline-container-orgf0d3d21" class="outline-2">
<h2 id="orgf0d3d21"><span class="section-number-2">5</span> 参考</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="https://github.com/myuhe/org-gcal.el">Org sync with Google Calendar </a></li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">&#33050;&#27880;: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
同じアイコンの [calDAV] に注意
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: clothoid</p>
<p class="date">Created: 2020-09-12 Sat 07:25</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
